Revit 2027 API
BuiltInFailures.ElectricalFailures.PanelMismatchCircuitType Property
 Cannot assign [Element] to Circuit. The Type for the panel does not match the Type ([Name]) for the Circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PanelMismatchCircuitType { get; }
Public Shared ReadOnly Property PanelMismatchCircuitType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PanelMismatchCircuitType {
	FailureDefinitionId^ get ();
}
static member PanelMismatchCircuitType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace